docs/org/client.org
#+TITLE: Client Documentation
#+AUTHOR: Petros Papapanagiotou
#+EMAIL: petros@workflowfm.com
#+OPTIONS: toc:nil email:t 
#+EXCLUDE_TAGS: noexport
#+PROPERTY: header-args :results output drawer :session workflowfm :exports both :eval no-export :dir ../../
#+HUGO_AUTO_SET_LASTMOD: t

#+HUGO_BASE_DIR: ../
#+HUGO_SECTION: client
#+HUGO_TYPE: docs
#+HUGO_PAIRED_SHORTCODES: tip 

** Other
   :PROPERTIES:
   :EXPORT_FILE_NAME: other
   :EXPORT_HUGO_WEIGHT: 390
   :END:

Some other available functionality is described here.

*** Show Graph

Once a composite process or an intermediate composition is created, its graph can be viewed on a separate window.

- This can be accomplished by *right-clicking* the composition and selecting the @@hugo:{{< icon "client/icons/ShowGraph.png" "show graph icon" "inline" >}}@@ ~Show Graph~ option.
- The full graph is also shown when hovering above the blue process box of a (collapsed) composite process.

This can be particularly useful for composite processes which appear as a single atomic process in subsequent compositions.

*** Load Compositions

In some cases it may be useful to reload the intermediate (binary) composition steps that we followed when a composite process was stored.

- This can be accomplished by *right-clicking* a composite process and selecting the @@hugo:{{< icon "client/icons/LoadCompositions.png" "load compositions icon" "inline" >}}@@ ~Load Compositions~ option.

This will create a new workspace and add all the composition steps used to create the selected process as intermediate compositions.

This can be particularly useful for example when a composite process has become invalid due to an updated component and you need to adjust the composition actions, or if a similar copy of the same composition is required, but the workspace no longer exists.


*** Inspect \pi-calculus

The reasoner automatically produces \pi-calculus specifications of the specified processes. These can be visualized and inspected using the [[http://frapu.de/bpm/piviztool.html][PiVizTool]], which has been directly integrated with the Client.

#+ATTR_SHORTCODE: warning
#+BEGIN_tip
The PiVizTool relies on [[https://graphviz.org/][GraphViz]]. The ~dot~ executable must be available in the ~PATH~ for it to function.
#+END_tip

- This can be accomplished by *right-clicking* the composition and selecting the @@hugo:{{< icon "client/icons/Inspect.png" "inspect pi calculus icon" "inline" >}}@@ ~Inspect pi-calculus~ option.

The graph includes a ~Request~ and a ~Response~ process, which are responsible for the sending the initial inputs and receiving the final outputs respectively.

The visualization is interactive. Resources are communicated between processes by clicking on black edges or using the icons at the top.

Some familiarity with \pi-calculus is required to be able to follow the execution steps.

#+ATTR_SHORTCODE: warning
#+BEGIN_tip
The PiVizTool has certain bugs which cause it to fail and give an error despite a valid pi-calculus specification. Unfortunately we have not been able to identify the source or resolve these issues.
#+END_tip

